{
  "terms": [
    { "term": "Buddy fucker", "definition": "An officer who intentionally makes another officer's job more difficult, usually out of malice or self-interest." },
    { "term": "Clusterfuck", "definition": "A chaotic, disorganized, or complicated situation that is difficult to manage or navigate." },
    { "term": "Flying fuck", "definition": "An expression of extreme indifference or disregard for a situation or person." },
    { "term": "FUBAR", "definition": "An acronym for \"Fucked Up Beyond All Recognition,\" describing a situation that is severely damaged or beyond repair." },
    { "term": "Fuck-all", "definition": "A slang term for \"nothing\" or \"very little,\" used to express a lack of importance or value." },
    { "term": "Fuck-around-itis", "definition": "A lack of focus, discipline, or commitment in one's work, leading to inefficiency or poor performance." },
    { "term": "Fuckathon", "definition": "An extended period or series of frustrating, challenging, or overwhelming events." },
    { "term": "Fuckbrained", "definition": "A term describing a person who consistently makes poor decisions or exhibits irrational behavior." },
    { "term": "Fucked", "definition": "A situation or problem that has gone awry or become problematic." },
    { "term": "Fucked over", "definition": "To be treated unfairly or to experience a significant disadvantage due to someone else's actions." },
    { "term": "Fuckenomics", "definition": "A sarcastic term used to describe a flawed or poorly thought-out economic policy or financial decision, particularly used in response to pay and/or benefits." },
    { "term": "Fuckeration", "definition": "A term for the collective group of people who exhibit undesirable or negative qualities." },
    { "term": "Fuckery", "definition": "Deceitful or underhanded behavior, typically involving manipulation or dishonesty." },
    { "term": "Fuckery-footed", "definition": "A term for someone who is clumsy or awkward, often causing problems or disruptions." },
    { "term": "Fuckfest", "definition": "A situation marked by chaos, confusion, or disarray, often to a comical or exaggerated degree." },
    { "term": "Fucking A", "definition": "An expression of enthusiastic agreement or strong approval." },
    { "term": "Fucking Oh", "definition": "An expression of extreme surprise or disbelief." },
    { "term": "Fuckload", "definition": "A colloquial term for a large amount or quantity, often used for emphasis." },
    { "term": "Fuckmonger", "definition": "A person who instigates conflict, trouble, or negative situations." },
    { "term": "Fucknado", "definition": "A whirlwind of chaos, confusion, or destructive behavior, often attributed to a specific person or event." },
    { "term": "Fucknut", "definition": "A term used to describe a person who behaves foolishly or is perceived as lacking competence." },
    { "term": "Fuckometer", "definition": "A hypothetical measure of the level of chaos, difficulty, or frustration in a situation." },
    { "term": "Fuckparade", "definition": "A series of unfortunate, frustrating, or disappointing events." },
    { "term": "Fuckproof", "definition": "A person or situation that is resistant to failure or impervious to negative outcomes." },
    { "term": "Fuckquake", "definition": "A significant and disruptive event or situation that causes widespread chaos or upheaval." },
    { "term": "Fucksational", "definition": "An ironic term used to describe a situation or event as being particularly unpleasant or undesirable." },
    { "term": "Fucksicle", "definition": "A term used to describe someone who is both irritating and cold-hearted." },
    { "term": "Fuckslinger", "definition": "A person who frequently uses profanity or vulgar language, especially in a confrontational manner." },
    { "term": "Fucksmith", "definition": "A person who is exceptionally skilled at creating or navigating difficult or chaotic situations." },
    { "term": "Fucksplosion", "definition": "A sudden and intense outburst of anger, chaos, or confusion." },
    { "term": "Fuckstick", "definition": "A derogatory term for a person who is considered incompetent, foolish, or annoying." },
    { "term": "Fuckstorm", "definition": "A chaotic and turbulent situation or person marked by high levels of stress, conflict, or confusion." },
    { "term": "Fuckstrated", "definition": "A blend of \"fuck\" and \"frustrated,\" used to express intense annoyance or irritation." },
    { "term": "Fucksultant", "definition": "A sarcastic term for someone who provides unsolicited or unhelpful advice in difficult situations, or injects difficulty into a previously controlled situation." },
    { "term": "Fucktacular", "definition": "A sarcastic term describing a situation or event as being remarkably bad or disastrous." },
    { "term": "Fucktard", "definition": "A derogatory term for someone who exhibits a lack of intelligence or common sense." },
    { "term": "Fucktopia", "definition": "A sarcastic term for an imaginary place where everything is chaotic, dysfunctional, or generally negative." },
    { "term": "Fucktose intolerant", "definition": "A term for someone who has a low tolerance for incompetence, foolishness, or irritating behavior." },
    { "term": "Fuck-up", "definition": "A mistake, error, or failure, often attributed to an individual's incompetence or negligence." },
    { "term": "Fuckupitude", "definition": "The quality or state of being prone to making mistakes or causing problems." },
    { "term": "Fuckventory", "definition": "A list or collection of mistakes, failures, or negative experiences, often used to emphasize the scale or impact of a problematic situation." },
    { "term": "Fuckweasel", "definition": "A derogatory term for a person who is deceitful, manipulative, or underhanded in their actions." },
    { "term": "Fuckwit", "definition": "A derogatory term for a person who is considered foolish, ignorant, or lacking common sense." },
    { "term": "Motherfucker", "definition": "A term used to describe a person in a derogatory manner, often due to their actions or attitude." },
    { "term": "Ratfucker", "definition": "An officer who cooperates with internal affairs against a fellow officer, often seen as a betrayal." },
    { "term": "SNAFU", "definition": "An acronym (\"Situation Normal All Fucked Up\") for a situation where things have gone awry or become problematic, but it is considered a typical or expected occurrence." },
    { "term": "Unfuckable", "definition": "A situation that is so challenging or complex that it seems impossible to resolve or improve. Alternatively, an especially unattractive person." },
    { "term": "Unfucked", "definition": "The resolution or improvement of a previously problematic situation." },
    { "term": "Unfuckwithable", "definition": "A person who is highly skilled, competent, or untouchable in their area of expertise." },
    { "term": "Zero fucks given", "definition": "An expression of complete indifference or apathy toward a situation, person, or outcome." }
  ],
  "correctResponses": [
    "Fuck yes!",
    "You're fucking amazing!",
    "Nailed it, you beautiful bastard!",
    "Holy shit, you got it!",
    "Fucking brilliant!",
    "Well fuck me, that's right!",
    "Abso-fucking-lutely correct!",
    "You fucking know your shit!",
    "Damn fucking straight!",
    "Fan-fucking-tastic!"
  ],
  "incorrectResponses": [
    "Try a little fucking harder please",
    "You fucking whiffed on that one",
    "What the fuck was that?",
    "Not even fucking close",
    "Fuck no, try again",
    "You really fucked that one up",
    "That answer was a clusterfuck",
    "Un-fucking-believable (in a bad way)",
    "FUBAR - that answer was FUBAR",
    "Fucking hell, that's not it"
  ]
}
